axf33480/ESP32CommandStation/src/ConfigurationManager.cpp
  if (factory_reset_config)
  {
    LOG(WARNING, "!!!! WARNING WARNING WARNING WARNING WARNING !!!!");
    LOG(WARNING, "!!!! WARNING WARNING WARNING WARNING WARNING !!!!");
    LOG(WARNING, "!!!! WARNING WARNING WARNING WARNING WARNING !!!!");
    LOG(WARNING,
        "[Config] The factory reset flag has been set to true, all persistent "
        "data will be cleared.");
    uint8_t countdown = 10;
    while (--countdown)
    {
      LOG(WARNING, "[Config] Factory reset will be initiated in %d seconds..."
        , countdown);
      usleep(SEC_TO_USEC(1));
    }
    LOG(WARNING, "[Config] Factory reset starting!");
  }

  LOG(VERBOSE, "[Config] Persistent storage contents:");
  recursiveWalkTree("/cfg", factory_reset_config);
  // Pre-create ESP32 CS configuration directory.
  mkdir(CS_CONFIG_DIR, ACCESSPERMS);
  // Pre-create LCC configuration directory.
  mkdir(LCC_CFG_DIR, ACCESSPERMS);

  if (exists(ESP32_CS_CONFIG_JSON))
  {
    LOG(INFO, "[Config] Found existing CS config file, attempting to load...");

    csConfig = json::parse(load(ESP32_CS_CONFIG_JSON)     // content to parse
                         , nullptr                        // callback (unused)
                         , false);                        // disable exceptions

    if (!csConfig.is_discarded() && // parse failure will set root to discarded
        validateConfiguration())
    {
      LOG(INFO
        , "[Config] Existing configuration successfully loaded and validated.");
      factory_reset_config = false;
      // Check for any missing default configuration settings.
      persist_config = seedDefaultConfigSections();
      // Check if we need to force a reset of the LCC config (node id change)
      auto lccConfig = csConfig[JSON_LCC_NODE];
      if (lccConfig.contains(JSON_LCC_FORCE_RESET_NODE) &&
          lccConfig[JSON_LCC_FORCE_RESET_NODE].get<bool>())
      {
        LOG(WARNING, "[Config] LCC force factory_reset flag is ENABLED!");
        csConfig[JSON_LCC_NODE][JSON_LCC_FORCE_RESET_NODE] = false;
        persist_config = true;
        lcc_factory_reset = true;
      }
    }
    else
    {
      LOG_ERROR("[Config] Existing configuration failed one (or more) "
                "validation(s) and will be regenerated!");
      LOG(VERBOSE, "[Config] Old config: %s", csConfig.dump().c_str());
      factory_reset_config = true;
    }
  }
  else
  {
    factory_reset_config = true;
  }

  if (factory_reset_config)
  {
    LOG(INFO, "[Config] Generating default configuration...");
    // TODO: break this up so it starts with an empty config and makes calls to
    // various "getDefaultConfigXXX" for each section.
    csConfig = {};
    persist_config = seedDefaultConfigSections();
    // force factory reset of LCC data
    lcc_factory_reset = true;
  }

  // if we need to persist the updated config do so now.
  if (persist_config)
  {
    LOG(INFO, "[Config] Persisting configuration settings");
    store(ESP32_CS_CONFIG_JSON, csConfig.dump());
    LOG(VERBOSE, "[Config] Updated config: %s", csConfig.dump().c_str());
  }
  LOG(VERBOSE, "[Config] %s", csConfig.dump().c_str());

  // If we are not currently forcing a factory reset, verify if the LCC config
  // file is the correct size. If it is not the expected size force a factory
  // reset.
  if (!lcc_factory_reset &&
      stat(LCC_CONFIG_FILE, &statbuf) >= 0 &&
      statbuf.st_size != openlcb::CONFIG_FILE_SIZE)
  {
    LOG(WARNING
      , "[LCC] Corrupt configuration file detected, %s is too small: %lu "
        "bytes, expected: %zu bytes"
      , LCC_CONFIG_FILE, statbuf.st_size, openlcb::CONFIG_FILE_SIZE);
    lcc_factory_reset = true;
  }

  // If we need an LCC factory reset trigger is now.
  if (lcc_factory_reset)
  {
    configStore->factory_reset_lcc(false);
  }
}

ConfigurationManager::~ConfigurationManager()
{
  extern std::unique_ptr<OpenMRN> openmrn;
  
  // Shutdown the auto-sync handler if it is running before unmounting the FS.
  if (configAutoSync_.get())
  {
    LOG(INFO, "[Config] Disabling automatic fsync(%d) calls...", configFd_);
    SyncNotifiable n;
    configAutoSync_->shutdown(&n);
    LOG(INFO, "[Config] Waiting for sync to stop");
    n.wait_for_notification();
    configAutoSync_.reset(nullptr);
  }

  // shutdown the executor so that no more tasks will run
  LOG(INFO, "[Config] Shutting down executor");
  openmrn->stack()->executor()->shutdown();

  LOG(INFO, "[Config] Shutting down Httpd executor");
  Singleton<esp32cs::http::Httpd>::instance()->executor()->shutdown();

  // close the config file if it is open
  if (configFd_ >= 0)
  {
    LOG(INFO, "[Config] Closing config file.");
    ::close(configFd_);
  }

  // Unmount the SPIFFS partition
  if (esp_spiffs_mounted(NULL))
  {
    LOG(INFO, "[Config] Unmounting SPIFFS...");
    ESP_ERROR_CHECK(esp_vfs_spiffs_unregister(NULL));
  }

  // Unmount the SD card if it was mounted
  if (sd_)
  {
    LOG(INFO, "[Config] Unmounting SD...");
    esp_vfs_fat_sdmmc_unmount();
  }
}

void ConfigurationManager::clear()
{
  LOG(INFO, "[Config] Clearing persistent config...");
  recursiveWalkTree(CS_CONFIG_DIR, true);
  mkdir(CS_CONFIG_DIR, ACCESSPERMS);
}

bool ConfigurationManager::exists(const string &name)
{
  string configFilePath = getFilePath(name);
  LOG(VERBOSE, "[Config] Checking for %s", configFilePath.c_str());
  return access(configFilePath.c_str(), F_OK) == 0;
}

void ConfigurationManager::remove(const string &name)
{
  string configFilePath = getFilePath(name);
  LOG(VERBOSE, "[Config] Removing %s", configFilePath.c_str());
  unlink(configFilePath.c_str());
}

string ConfigurationManager::load(const string &name)
{
  string configFilePath = getFilePath(name);
  if (!exists(name))
  {
    LOG(VERBOSE, "[Config] Failed to load: %s", configFilePath.c_str());
    return "{}";
  }
  LOG(VERBOSE, "[Config] Loading %s", configFilePath.c_str());
  return read_file_to_string(configFilePath);
}

void ConfigurationManager::store(const char *name, const string &content)
{
  string configFilePath = getFilePath(name);
  LOG(VERBOSE, "[Config] Storing %s, %d bytes", configFilePath.c_str()
    , content.length());
  write_string_to_file(configFilePath, content);
}

void ConfigurationManager::factory_reset()
{
  remove(ESP32_CS_CONFIG_JSON);
}

void ConfigurationManager::factory_reset_lcc(bool warn)
{
  if (!access(LCC_CONFIG_FILE, F_OK) ||
      !access(LCC_CDI_XML, F_OK))
  {
    if (warn)
    {
      LOG(WARNING, "[Config] LCC factory reset underway...");
    }

